src/InformationRegisters/КомментарииФайловДокументовКЭДО/КомментарииФайловДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииФайловДокументовКЭДО</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКомментария</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗапланированныеДействияСФайламиДокументовКЭДО/ЗапланированныеДействияСФайламиДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапланированныеДействияСФайламиДокументовКЭДО</name>
  <attributes>
    <name>ДатаЗадания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаетПодписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияСФайламиДокументовКЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ДействияСФайламиДокументовКЭДО/ДействияСФайламиДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияСФайламиДокументовКЭДО</name>
  <enumValues>
    <name>Подписать</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьПоПочте</name>
  </enumValues>
  <enumValues>
    <name>ПередатьВКабинетСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ПередатьНаРаботаВРоссии</name>
  </enumValues>
  <enumValues>
    <name>ЗаписатьНаДиск</name>
  </enumValues>
  <enumValues>
    <name>Ознакомиться</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/КомментарииФайловДокументовКЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция КомментарииФайла(ЭлектронныйДокумент) Экспорт
	
	Комментарии = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомментарииФайлов.Исполнитель КАК Исполнитель,
		|	КомментарииФайлов.ДатаКомментария КАК ДатаКомментария,
		|	КомментарииФайлов.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА ЗапланированныеДействия.ПрисоединенныйФайл ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Ознакомиться
		|ИЗ
		|	РегистрСведений.КомментарииФайловДокументовКЭДО КАК КомментарииФайлов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗапланированныеДействияСФайламиДокументовКЭДО КАК ЗапланированныеДействия
		|		ПО КомментарииФайлов.ПрисоединенныйФайл = ЗапланированныеДействия.ПрисоединенныйФайл
		|			И (ЗапланированныеДействия.Исполнитель = &ТекущийПользователь)
		|			И (ЗапланированныеДействия.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСФайламиДокументовКЭДО.Ознакомиться))
		|ГДЕ
		|	КомментарииФайлов.ПрисоединенныйФайл = &ПрисоединенныйФайл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаКомментария,
		|	Исполнитель,
		|	Комментарий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Комментарий = Новый Структура("Исполнитель,ДатаКомментария,Комментарий,Ознакомиться");
		ЗаполнитьЗначенияСвойств(Комментарий, Выборка);
		
		Комментарии.Добавить(Комментарий);
		
	КонецЦикла;
	
	Возврат Комментарии;
	
КонецФункции

Процедура ДобавитьКомментарийФайла(ПрисоединенныйФайл, ТекстКомментария, ТекущийПользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ФайлыКОбработке = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПрисоединенныйФайл);
	
	// Регистрируется комментарий причины отказа в подписании
	НаборЗаписей = РегистрыСведений.КомментарииФайловДокументовКЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрисоединенныйФайл.Установить(ПрисоединенныйФайл);
	НаборЗаписей.Отбор.Исполнитель.Установить(ТекущийПользователь);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ПрисоединенныйФайл = ПрисоединенныйФайл;
	Запись.Исполнитель = ТекущийПользователь;
	Запись.Комментарий = ТекстКомментария;
	Запись.ДатаКомментария = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
	// Отменяются все запланированные действия
	РегистрыСведений.ЗапланированныеДействияСФайламиДокументовКЭДО.УдалитьФайлыИзОбработки(ФайлыКОбработке);
	
	// Планируются ознакомления всех пользователей, ранее подписавших электронный документ
	ОзнакомляемыеОтветственные = Новый Массив;
	ПодписиФайла = ЭлектроннаяПодпись.УстановленныеПодписи(ПрисоединенныйФайл);
	Для Каждого СвойстваПодписи Из ПодписиФайла Цикл
		Если ЗначениеЗаполнено(СвойстваПодписи.УстановившийПодпись) Тогда
			ОзнакомляемыеОтветственные.Добавить(СвойстваПодписи.УстановившийПодпись);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ПараметрыДанныхФайла);
	Если ЗначениеЗаполнено(ДанныеФайла.Владелец) Тогда
		МетаданныеВладельца = ДанныеФайла.Владелец.Метаданные();
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", МетаданныеВладельца) Тогда
			ОтветственныйВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФайла.Владелец, "Ответственный");
			Если ЗначениеЗаполнено(ОтветственныйВладельца)
				И ОзнакомляемыеОтветственные.Найти(ОтветственныйВладельца) = Неопределено Тогда
				
				ОзнакомляемыеОтветственные.Добавить(ОтветственныйВладельца);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОзнакомляемыеОтветственные) Тогда
		РегистрыСведений.ЗапланированныеДействияСФайламиДокументовКЭДО.ЗарегистрироватьОбработкуФайловИсполнителям(
			ФайлыКОбработке,
			Перечисления.ДействияСФайламиДокументовКЭДО.Ознакомиться,
			ОзнакомляемыеОтветственные,
			Истина);
		КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
